RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_iee_apc.c
/*
 * Copyright 2020-2021,2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_iee_apc.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.iee_apc"
#endif

#define IOMUXC_LPSR_GPR_APC_ADDR_MASK 0xFFFFFFF8U

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief Enable the APC IEE Region setting.
 *
 * This function enables IOMUXC LPSR GPR and APC IEE for setting the region.
 *
 * param base APC IEE peripheral address.
 */
void IEE_APC_GlobalEnable(IEE_APC_Type *base)
{
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
    /* APC_x bits in GPR2 to GPR25 only take effect when this bit is set high */
    IOMUXC_LPSR_GPR->GPR25 |= IOMUXC_LPSR_GPR_GPR25_APC_VALID_MASK;
    __DSB();
#else
    for(uint32_t i = (uint32_t)kIEE_APC_Region0; i <= (uint32_t)kIEE_APC_Region7; i++)
    {
      IEE_APC_RegionEnable(base, (iee_apc_region_t)i);
    }
#endif
    return;
}

/*!
 * brief Disables the APC IEE Region setting.
 *
 * This function disables IOMUXC LPSR GPR and APC IEE for setting the region.
 *
 * param base APC IEE peripheral address.
 */
void IEE_APC_GlobalDisable(IEE_APC_Type *base)
{
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
    /* APC_x bits in GPR2 to GPR25 only take effect when this bit is set high */
    IOMUXC_LPSR_GPR->GPR25 &= ~IOMUXC_LPSR_GPR_GPR25_APC_VALID_MASK;
    __DSB();
    return;
#else
    for(uint32_t i = (uint32_t)kIEE_APC_Region0; i <= (uint32_t)kIEE_APC_Region7; i++)
    {
      IEE_APC_RegionDisable(base, (iee_apc_region_t)i);
    }
#endif
}

/*!
 * brief Sets the APC IEE Memory Region setting.
 *
 * This function configure IOMUXC LPSR GPR and APC IEE for the encryption region.
 *
 * param base APC IEE peripheral address.
 * param region Selection of the APC IEE region to be configured.
 * param startAddr Start encryption adress for the selected APC IEE region.
 * param endAddr End encryption adress for the selected APC IEE region.
 */
status_t IEE_APC_SetRegionConfig(IEE_APC_Type *base, iee_apc_region_t region, uint32_t startAddr, uint32_t endAddr)
{
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
    /* bit[2:0] of adress must be zero
     *
     * Note: For i.MXRT1170, region is [bot:top), the end is open interval. So the bit[2:0] of the end address must
     * be zero.
     * Note: from design's aspect, 'top' means the top of the space, the higher address which is the end
     * address.
     */
    if ((startAddr & (~IOMUXC_LPSR_GPR_GPR3_APC_AC_R0_TOP_MASK)) != 0U ||
        (endAddr & (~IOMUXC_LPSR_GPR_GPR2_APC_AC_R0_BOT_MASK)) != 0U)
    {
        return kStatus_InvalidArgument;
    }
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */

    if (region == kIEE_APC_Region0)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR2 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR3 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;

        base->REGION0_BOT_ADDR = startAddr >> 3u;
        base->REGION0_TOP_ADDR = endAddr >> 3u;
#else
        base->REGION0_BOT_ADDR = startAddr;
        base->REGION0_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region1)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR4 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR5 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION1_BOT_ADDR = startAddr >> 3u;
        base->REGION1_TOP_ADDR = endAddr >> 3u;
#else
        base->REGION1_BOT_ADDR = startAddr;
        base->REGION1_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region2)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR6 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR7 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION2_BOT_ADDR = startAddr >> 3;
        base->REGION2_TOP_ADDR = endAddr >> 3;
#else
        base->REGION2_BOT_ADDR = startAddr;
        base->REGION2_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region3)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR8 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR9 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION3_BOT_ADDR = startAddr >> 3;
        base->REGION3_TOP_ADDR = endAddr >> 3;
#else
        base->REGION3_BOT_ADDR = startAddr;
        base->REGION3_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region4)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR10 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR11 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION4_BOT_ADDR = startAddr >> 3;
        base->REGION4_TOP_ADDR = endAddr >> 3;
#else
        base->REGION4_BOT_ADDR = startAddr;
        base->REGION4_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region5)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR12 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR13 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION5_BOT_ADDR = startAddr >> 3;
        base->REGION5_TOP_ADDR = endAddr >> 3;
#else
        base->REGION5_BOT_ADDR = startAddr;
        base->REGION5_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region6)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR14 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR15 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION6_BOT_ADDR = startAddr >> 3;
        base->REGION6_TOP_ADDR = endAddr >> 3;
#else
        base->REGION6_BOT_ADDR = startAddr;
        base->REGION6_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }
    if (region == kIEE_APC_Region7)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR16 |= startAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        IOMUXC_LPSR_GPR->GPR17 |= endAddr & IOMUXC_LPSR_GPR_APC_ADDR_MASK;
        base->REGION7_BOT_ADDR = startAddr >> 3;
        base->REGION7_TOP_ADDR = endAddr >> 3;
#else
        base->REGION7_BOT_ADDR = startAddr;
        base->REGION7_TOP_ADDR = endAddr;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) */
    }

    return kStatus_Success;
}

