RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_iee_apc.c
#if !(defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u))
/*!
 * brief Lock the LPSR GPR and APC IEE configuration.
 *
 * This function locks writting to IOMUXC LPSR GPR and APC IEE encryption region setting registers.
 * Only system reset can clear the LPSR GPR and APC IEE-RDC_D0/1 Lock bit
 *
 * param base APC IEE peripheral address.
 * param region Selection of the APC IEE region to be locked.
 * param domain Domain ID to access the IEE APC registers of this region. The ID is drivn by TRDC.
 */
status_t IEE_APC_LockRegionConfig(IEE_APC_Type *base, iee_apc_region_t region, uint8_t domain)
{
    uint32_t didVal = 0u;
  
    if (region == kIEE_APC_Region0)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION0_ACC_CTL ;
        /* Clear ALLOW_DID */
        didVal = didVal & (~IEE_APC_REGION0_ACC_CTL_ALLOW_DID_MASK);
        /* Set new acces control value */
        base->REGION0_ACC_CTL = didVal | IEE_APC_REGION0_ACC_CTL_ALLOW_DID(domain);
        
        /* Once this bit is set, the value of the lower half word can't be changed 
         * until next system reset. The access check against domain ID will only 
         * take effect once this bit is set. */
        base->REGION0_ACC_CTL |= IEE_APC_REGION0_ACC_CTL_LOCK_L_MASK;
        base->REGION0_ACC_CTL |= IEE_APC_REGION0_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region1)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION1_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION1_ACC_CTL_ALLOW_DID_MASK);
        base->REGION1_ACC_CTL = didVal | IEE_APC_REGION1_ACC_CTL_ALLOW_DID(domain);

        base->REGION1_ACC_CTL |= IEE_APC_REGION1_ACC_CTL_LOCK_L_MASK;
        base->REGION1_ACC_CTL |= IEE_APC_REGION1_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region2)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION2_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION2_ACC_CTL_ALLOW_DID_MASK);
        base->REGION2_ACC_CTL = didVal | IEE_APC_REGION2_ACC_CTL_ALLOW_DID(domain);
        
        base->REGION2_ACC_CTL |= IEE_APC_REGION2_ACC_CTL_LOCK_L_MASK;
        base->REGION2_ACC_CTL |= IEE_APC_REGION2_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region3)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION3_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION3_ACC_CTL_ALLOW_DID_MASK);
        base->REGION3_ACC_CTL = didVal | IEE_APC_REGION3_ACC_CTL_ALLOW_DID(domain);

        base->REGION3_ACC_CTL |= IEE_APC_REGION3_ACC_CTL_LOCK_L_MASK;
        base->REGION3_ACC_CTL |= IEE_APC_REGION3_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region4)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION4_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION4_ACC_CTL_ALLOW_DID_MASK);
        base->REGION4_ACC_CTL = didVal | IEE_APC_REGION4_ACC_CTL_ALLOW_DID(domain);

        
        base->REGION4_ACC_CTL |= IEE_APC_REGION4_ACC_CTL_LOCK_L_MASK;
        base->REGION4_ACC_CTL |= IEE_APC_REGION4_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region5)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION5_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION5_ACC_CTL_ALLOW_DID_MASK);
        base->REGION5_ACC_CTL = didVal | IEE_APC_REGION5_ACC_CTL_ALLOW_DID(domain);
        
        base->REGION5_ACC_CTL |= IEE_APC_REGION5_ACC_CTL_LOCK_L_MASK;
        base->REGION5_ACC_CTL |= IEE_APC_REGION5_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region6)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION6_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION6_ACC_CTL_ALLOW_DID_MASK);
        base->REGION6_ACC_CTL = didVal | IEE_APC_REGION6_ACC_CTL_ALLOW_DID(domain);
        
        base->REGION6_ACC_CTL |= IEE_APC_REGION6_ACC_CTL_LOCK_L_MASK;
        base->REGION6_ACC_CTL |= IEE_APC_REGION6_ACC_CTL_LOCK_H_MASK;
    }
    if (region == kIEE_APC_Region7)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        didVal = base->REGION7_ACC_CTL ;
        didVal = didVal & (~IEE_APC_REGION7_ACC_CTL_ALLOW_DID_MASK);
        base->REGION7_ACC_CTL = didVal | IEE_APC_REGION7_ACC_CTL_ALLOW_DID(domain);
        
        base->REGION7_ACC_CTL |= IEE_APC_REGION7_ACC_CTL_LOCK_L_MASK;
        base->REGION7_ACC_CTL |= IEE_APC_REGION7_ACC_CTL_LOCK_H_MASK;
    }

    return kStatus_Success;
}
#endif /* !(defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)) */

#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
/*!
 * brief Lock the LPSR GPR and APC IEE configuration.
 *
 * This function locks writting to IOMUXC LPSR GPR and APC IEE encryption region setting registers.
 * Only system reset can clear the LPSR GPR and APC IEE-RDC_D0/1 Lock bit
 *
 * param base APC IEE peripheral address.
 * param region Selection of the APC IEE region to be locked.
 * param domain Core domain ID
 */
status_t IEE_APC_LockRegionConfig(IEE_APC_Type *base, iee_apc_region_t region, iee_apc_domain_t domain)
{
    if (region == kIEE_APC_Region0)
    {
        /* Locks write into APC Region 0 BOT address */
        IOMUXC_LPSR_GPR->GPR2 |= IOMUXC_LPSR_GPR_GPR2_LOCK(1);
        /* Locks write into APC Region 0 TOP address */
        IOMUXC_LPSR_GPR->GPR3 |= IOMUXC_LPSR_GPR_GPR3_LOCK(1);
        /* Locks write into APC REGION 0 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR18 |= IOMUXC_LPSR_GPR_GPR18_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION0_RDC_D0 |= IEE_APC_REGION0_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION0_RDC_D0 |= IEE_APC_REGION0_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION0_RDC_D1 |= IEE_APC_REGION0_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION0_RDC_D1 |= IEE_APC_REGION0_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region1)
    {
        /* Locks write into APC Region 1 BOT address */
        IOMUXC_LPSR_GPR->GPR4 |= IOMUXC_LPSR_GPR_GPR4_LOCK(1);
        /* Locks write into APC Region 1 TOP address */
        IOMUXC_LPSR_GPR->GPR5 |= IOMUXC_LPSR_GPR_GPR5_LOCK(1);
        /* Locks write into APC REGION 1 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR19 |= IOMUXC_LPSR_GPR_GPR19_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION1_RDC_D0 |= IEE_APC_REGION1_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION1_RDC_D0 |= IEE_APC_REGION1_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION1_RDC_D1 |= IEE_APC_REGION1_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION1_RDC_D1 |= IEE_APC_REGION1_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region2)
    {
        /* Locks write into APC Region 2 BOT address */
        IOMUXC_LPSR_GPR->GPR6 |= IOMUXC_LPSR_GPR_GPR6_LOCK(1);
        /* Locks write into APC Region 2 TOP address */
        IOMUXC_LPSR_GPR->GPR7 |= IOMUXC_LPSR_GPR_GPR7_LOCK(1);
        /* Locks write into APC REGION 2 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR20 |= IOMUXC_LPSR_GPR_GPR20_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION2_RDC_D0 |= IEE_APC_REGION2_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION2_RDC_D0 |= IEE_APC_REGION2_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION2_RDC_D1 |= IEE_APC_REGION2_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION2_RDC_D1 |= IEE_APC_REGION2_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region3)
    {
        /* Locks write into APC Region 3 BOT address */
        IOMUXC_LPSR_GPR->GPR8 |= IOMUXC_LPSR_GPR_GPR8_LOCK(1);
        /* Locks write into APC Region 3 TOP address */
        IOMUXC_LPSR_GPR->GPR9 |= IOMUXC_LPSR_GPR_GPR9_LOCK(1);
        /* Locks write into APC REGION 3 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR21 |= IOMUXC_LPSR_GPR_GPR21_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION3_RDC_D0 |= IEE_APC_REGION3_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION3_RDC_D0 |= IEE_APC_REGION3_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION3_RDC_D1 |= IEE_APC_REGION3_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION3_RDC_D1 |= IEE_APC_REGION3_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region4)
    {
        /* Locks write into APC Region 4 BOT address */
        IOMUXC_LPSR_GPR->GPR10 |= IOMUXC_LPSR_GPR_GPR10_LOCK(1);
        /* Locks write into APC Region 4 TOP address */
        IOMUXC_LPSR_GPR->GPR11 |= IOMUXC_LPSR_GPR_GPR11_LOCK(1);
        /* Locks write into APC REGION 4 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR22 |= IOMUXC_LPSR_GPR_GPR22_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION4_RDC_D0 |= IEE_APC_REGION4_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION4_RDC_D0 |= IEE_APC_REGION4_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION4_RDC_D1 |= IEE_APC_REGION4_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION4_RDC_D1 |= IEE_APC_REGION4_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region5)
    {
        /* Locks write into APC Region 5 BOT address */
        IOMUXC_LPSR_GPR->GPR12 |= IOMUXC_LPSR_GPR_GPR12_LOCK(1);
        /* Locks write into APC Region 5 TOP address */
        IOMUXC_LPSR_GPR->GPR13 |= IOMUXC_LPSR_GPR_GPR13_LOCK(1);
        /* Locks write into APC REGION 5 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR23 |= IOMUXC_LPSR_GPR_GPR23_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION5_RDC_D0 |= IEE_APC_REGION5_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION5_RDC_D0 |= IEE_APC_REGION5_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION5_RDC_D1 |= IEE_APC_REGION5_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION5_RDC_D1 |= IEE_APC_REGION5_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region6)
    {
        /* Locks write into APC Region 6 BOT address */
        IOMUXC_LPSR_GPR->GPR14 |= IOMUXC_LPSR_GPR_GPR14_LOCK(1);
        /* Locks write into APC Region 6 TOP address */
        IOMUXC_LPSR_GPR->GPR15 |= IOMUXC_LPSR_GPR_GPR15_LOCK(1);
        /* Locks write into APC REGION 6 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR24 |= IOMUXC_LPSR_GPR_GPR24_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION6_RDC_D0 |= IEE_APC_REGION6_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION6_RDC_D0 |= IEE_APC_REGION6_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION6_RDC_D1 |= IEE_APC_REGION6_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION6_RDC_D1 |= IEE_APC_REGION6_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }
    if (region == kIEE_APC_Region7)
    {
        /* Locks write into APC Region 7 BOT address */
        IOMUXC_LPSR_GPR->GPR16 |= IOMUXC_LPSR_GPR_GPR15_LOCK(1);
        /* Locks write into APC Region 7 TOP address */
        IOMUXC_LPSR_GPR->GPR17 |= IOMUXC_LPSR_GPR_GPR16_LOCK(1);
        /* Locks write into APC REGION 7 Valid, Debug, Sand box, Safe box, Execute only and Encrytp enable bits */
        IOMUXC_LPSR_GPR->GPR25 |= IOMUXC_LPSR_GPR_GPR25_LOCK(1);

        if (domain == kIEE_APC_Domain0)
        {
            base->REGION7_RDC_D0 |= IEE_APC_REGION7_RDC_D0_RDC_D0_WRITE_DIS_MASK;
            base->REGION7_RDC_D0 |= IEE_APC_REGION7_RDC_D0_RDC_D0_LOCK_MASK;
        }
        else if (domain == kIEE_APC_Domain1)
        {
            base->REGION7_RDC_D1 |= IEE_APC_REGION7_RDC_D1_RDC_D1_WRITE_DIS_MASK;
            base->REGION7_RDC_D1 |= IEE_APC_REGION7_RDC_D1_RDC_D1_LOCK_MASK;
        }
        else
        {
            /* Intentional empty */
        }
    }

    return kStatus_Success;
}
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */

