RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_iee_apc.c
#if !(defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u))
/*!
 * brief Set access control of the APC IEE.
 *
 * This function configure APC IEE encryption region access control settings.
 *
 * param base APC IEE peripheral address.
 * param region Selection of the APC IEE region to be locked.
 * param allowNonSecure Allow nonsecure mode access
 * param allowUser Allow user mode access
 */
status_t IEE_APC_SetAccessControl(IEE_APC_Type *base, iee_apc_region_t region, bool allowNonSecure, bool allowUser)
{
    uint32_t allowCltVal = 0u;
  
    if (region == kIEE_APC_Region0)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION0_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION0_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION0_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION0_ACC_CTL = allowCltVal | IEE_APC_REGION0_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION0_ACC_CTL_ALLOW_USER(allowUser);

    }
    if (region == kIEE_APC_Region1)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION1_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION1_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION1_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION1_ACC_CTL = allowCltVal | IEE_APC_REGION1_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION1_ACC_CTL_ALLOW_USER(allowUser);
    }
    if (region == kIEE_APC_Region2)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION2_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION2_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION2_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION2_ACC_CTL = allowCltVal | IEE_APC_REGION2_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION2_ACC_CTL_ALLOW_USER(allowUser);
    }
    if (region == kIEE_APC_Region3)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION3_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION3_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION3_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION3_ACC_CTL = allowCltVal | IEE_APC_REGION3_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION3_ACC_CTL_ALLOW_USER(allowUser);
    }
    if (region == kIEE_APC_Region4)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION4_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION4_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION4_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION4_ACC_CTL = allowCltVal | IEE_APC_REGION4_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION4_ACC_CTL_ALLOW_USER(allowUser);
    }
    if (region == kIEE_APC_Region5)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION5_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION5_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION5_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION5_ACC_CTL = allowCltVal | IEE_APC_REGION5_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION5_ACC_CTL_ALLOW_USER(allowUser);
    }
    if (region == kIEE_APC_Region6)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION6_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION6_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION6_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION6_ACC_CTL = allowCltVal | IEE_APC_REGION6_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION6_ACC_CTL_ALLOW_USER(allowUser);
    }
    if (region == kIEE_APC_Region7)
    {
        /* Set allowed domain ID to access the IEE APC registers of this region. */
        allowCltVal = base->REGION6_ACC_CTL;
        /* Clear allow user and ns */
        allowCltVal = allowCltVal & (~IEE_APC_REGION6_ACC_CTL_ALLOW_NS_MASK);
        allowCltVal = allowCltVal & (~IEE_APC_REGION6_ACC_CTL_ALLOW_USER_MASK);
        /* Set new acces control value */
        base->REGION6_ACC_CTL = allowCltVal | IEE_APC_REGION6_ACC_CTL_ALLOW_NS(allowNonSecure) | 
                                IEE_APC_REGION6_ACC_CTL_ALLOW_USER(allowUser);
    }
    return kStatus_Success;
}
#endif /* !(defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)) */

/*!
 * brief Enable the IEE encryption/decryption for specific region.
 *
 * This function enables encryption/decryption by writting to IOMUXC LPSR GPR.
 *
 * param base APC IEE peripheral address.
 * param region Selection of the APC IEE region to be enabled.
 */
void IEE_APC_RegionEnable(IEE_APC_Type *base, iee_apc_region_t region)
{

    if (region == kIEE_APC_Region0)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR18 |= IOMUXC_LPSR_GPR_GPR18_APC_R0_ENCRYPT_ENABLE_MASK;
#else
        base->REGION0_ENA |= IEE_APC_REGION0_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region1)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR19 |= IOMUXC_LPSR_GPR_GPR19_APC_R1_ENCRYPT_ENABLE_MASK;
#else
        base->REGION1_ENA |= IEE_APC_REGION1_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region2)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR20 |= IOMUXC_LPSR_GPR_GPR20_APC_R2_ENCRYPT_ENABLE_MASK;
#else
        base->REGION2_ENA |= IEE_APC_REGION2_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region3)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)

        IOMUXC_LPSR_GPR->GPR21 |= IOMUXC_LPSR_GPR_GPR21_APC_R3_ENCRYPT_ENABLE_MASK;
#else
        base->REGION3_ENA |= IEE_APC_REGION3_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region4)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR22 |= IOMUXC_LPSR_GPR_GPR22_APC_R4_ENCRYPT_ENABLE_MASK;
#else
        base->REGION4_ENA |= IEE_APC_REGION4_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region5)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR23 |= IOMUXC_LPSR_GPR_GPR23_APC_R5_ENCRYPT_ENABLE_MASK;
#else
        base->REGION5_ENA |= IEE_APC_REGION5_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region6)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR24 |= IOMUXC_LPSR_GPR_GPR24_APC_R6_ENCRYPT_ENABLE_MASK;
#else
        base->REGION6_ENA |= IEE_APC_REGION6_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }
    if (region == kIEE_APC_Region7)
    {
#if defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)
        IOMUXC_LPSR_GPR->GPR25 |= IOMUXC_LPSR_GPR_GPR25_APC_R7_ENCRYPT_ENABLE_MASK;
#else
        base->REGION7_ENA |= IEE_APC_REGION7_ENA_ENCRYPT_ENABLE_MASK;
#endif /* defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u) */
    }

    return;
}

#if !(defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u))
/*!
 * brief Disable the IEE encryption/decryption for specific region.
 *
 * This function disables encryption/decryption by writting to IOMUXC LPSR GPR.
 *
 * param base APC IEE peripheral address.
 * param region Selection of the APC IEE region to be enabled.
 */
void IEE_APC_RegionDisable(IEE_APC_Type *base, iee_apc_region_t region)
{
    if (region == kIEE_APC_Region0)
    {
        base->REGION0_ENA = 0u;
    }
    if (region == kIEE_APC_Region1)
    {
        base->REGION1_ENA = 0u;
    }
    if (region == kIEE_APC_Region2)
    {
        base->REGION2_ENA = 0u;
    }
    if (region == kIEE_APC_Region3)
    {
        base->REGION3_ENA = 0u;
    }
    if (region == kIEE_APC_Region4)
    {
        base->REGION4_ENA = 0u;
    }
    if (region == kIEE_APC_Region5)
    {
        base->REGION5_ENA = 0u;
    }
    if (region == kIEE_APC_Region6)
    {
        base->REGION6_ENA = 0u;
    }
    if (region == kIEE_APC_Region7)
    {
        base->REGION7_ENA = 0u;
    }

    return;
}
#endif /* !(defined(FSL_FEATURE_IEE_APC_USE_GPR) && (FSL_FEATURE_IEE_APC_USE_GPR > 0u)) */